/*1.ќбъ€вить массив на 10 элементов, заполнить его 3 способами:
при объ€влении, с клавиатуры, случайными числами. ¬ывести элементы массива на экран.*/
//----------------------------------------------------------------
#include <stdio.h>
#include <math.h>
#include <locale.h>
//----------------------------------------------------------------
int main()

{
system("color 2");
setlocale(LC_ALL, "Rus");
int i,n=10;
int res1[]={0 ,1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9};
int res2[10];
int res3[10];
printf("ћассив (при объ€влении)=");
for (i=0;i!=10;i++)
{
printf("%d ",res1[i]);
}
printf("\n");
for (i=0;i!=10;i++)
{
printf("¬ведите %d элемент массива ",i); 
scanf("%d",&res2[i]);
}
printf("\n2 массив (с клавиатуры)=");
for (i=0;i!=10;i++)
{
printf("%d ",res2[i]);
}
printf("\n");
printf("\n3 массив (случайные числа)=");
    srand(time(0));
    for (i = 0; i < n; i++) {
        res3[i] = rand() % 100;
        printf("%d ", res3[i]);
    }
    putchar('\n');
    getchar();
getchar();
return 0;
}
//----------------------------------------------------------------
