/*1.¬ массиве ј (45) найти локальные максимумы, определить их местоположение. 
Ћокальным максимумом назовем элемент массива, 
значение которого больше, чем значени€ двух соседних с ним элементов.*/
//----------------------------------------------------------------
#include <stdio.h>
#include <math.h>
#include <locale.h>
#define N 45
//----------------------------------------------------------------
void lokmaks(int *res);
//----------------------------------------------------------------
int main () 
{
system("color 2");
setlocale(LC_ALL, "Rus");
int a[N]={1,34,6,8,9,5,5,2,5,563,55,63,5,6,35,5,63,45,735,6,3,5435,4,546,7,4535,45,35,3,453,45,34,5678};
lokmaks(a);
getchar();
return 0;
}
//----------------------------------------------------------------
void lokmaks(int *res)
{
	int i,k=0,p[N]; 
    for (i=1;i<N-1;i++) 
	{
        if ((res[i-1]<res[i])&&(res[i+1]<res[i]))
        {
            p[k]=i;
            k++;
        }
    }
printf("Ќомера локальных максимумов: ");
for (i=0;i<k;i++) 
{
	printf("%d ",p[i]);
}
}
//----------------------------------------------------------------
