/*2.Удалить из одномерного массива все элементы,
 значения которых в этом массиве повторяются, оставив по одному.*/
//----------------------------------------------------------------
#include <stdio.h>
#include <math.h>
#include <locale.h>
#define N 20
//----------------------------------------------------------------
void vblvod(int *res2);
void Del(int *A);
//----------------------------------------------------------------
int main () 
{
system("color 2");
setlocale(LC_ALL, "Rus");
int a[N]={4,45,3345,35,35,34,5,6,84,53,7,6,6,6,35,6456,6,3,534,5};
printf("Первоначальный массив:\t");
vblvod(a);
Del(a);
printf("Конечный массив:\t");
vblvod(a);
getchar();
}
//----------------------------------------------------------------
void vblvod(int *res2)
{
	int i;
    for (i=0;i!=N;i++)
	{
		printf("%d ",res2[i]);
	}
printf("\n\n");
}
//----------------------------------------------------------------
void Del(int *A)
{
int i,o,i2;
for (o=0; o<N+1; o++)
{
	for (i=0; i<N; i++)
	{
		for (i2=i+1;i2<N;i2++)
	{
		if (A[i]==A[i2] && A[i]!=0)
		{
			A[i2]=0;
}}
	if (A[i]==0)
	{
		A[i]=A[i+1];
		A[N]=0;
	}}
}}
//----------------------------------------------------------------
