/*1.Написать функцию, проверяющую, являются ли два числа взаимно простыми.*/
//----------------------------------------------------------------
#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
//----------------------------------------------------------------
void Prov(int x1,int x2);
 //----------------------------------------------------------------
int main() 
{
    system("color 2");
	setlocale(LC_ALL, "Rus");
    unsigned int x, y;
    printf("Введите два натуральных числа ");
    scanf("%d %d",&x,&y);
    Prov(x,y);
    getchar();
    return 0;
}
 //----------------------------------------------------------------
void Prov(int x1,int x2) 
{
    int t; 
    while (x2)
	{
        t=x1%x2;
        x1=x2;
        x2=t;
    }
    if (x1==1)
    printf("Данные два числа являются взаимно простыми");
    else
    printf("Данные два числа НЕ являются взаимно простыми");
    getchar();
}
//----------------------------------------------------------------
