/*3.Написать функцию, вычисляющую площади вписанной и описанной окружности для квадрата со стороной a.*/
//----------------------------------------------------------------
#include <stdio.h>
#include <math.h>
#include <locale.h>
//----------------------------------------------------------------
void Svpos(int x);
//----------------------------------------------------------------
int main() 
{
    system("color 2");
	setlocale(LC_ALL, "Rus");
    int a;
    printf("Введите сторону квадрата ");
    scanf("%d",&a);
    Svpos(a);
    getchar();
    return 0;
}
//----------------------------------------------------------------
 void Svpos(int x)
 {
	float S,S2;
 	printf("\nПлощадь вписанной окружности = ");
 	S=(((x/2)*(x/2))*M_PI);
 	printf("%f",S);
 	printf("\nПлощадь описанной окружности = ");
 	S2=(((x*x)/2)*M_PI);
 	printf("%f",S2);
 	getchar();
 }
//----------------------------------------------------------------
