/*4.Написать функцию, вычисляющую максимальный элемент по трем заданным аргументам.*/
//----------------------------------------------------------------
#include <stdio.h>
#include <math.h>
#include <locale.h>
//----------------------------------------------------------------
void MaxE(float x,float y,float z);
//----------------------------------------------------------------
int main() 
{
    system("color 2");
    float a1,a2,a3;
	setlocale(LC_ALL, "Rus");
    printf("Введите три числа: ");
    scanf("%f%f%f",&a1,&a2,&a3);
    MaxE(a1,a2,a3);
    getchar();
    return 0;
}
//---------------------------------------------------------------
 void MaxE(float x,float y,float z)
 {
 	if ((x>y && y>z) || (x>z && z>y) || (x==y && x>z)) printf ("Наибольшее число = %f",x);
 	else if ((y>x && x>z) || (y>z && z>x) ||(y==z && z>x)) printf ("Наибольшее число = %f",y);
 	else if ((z>x && x>y) || (z>y && y>x) ||(z==x && x>y)) printf ("Наибольшее число = %f",z);
 	else if (x==y && y==z) printf ("Наибольшее число = %f",x);
 	else printf ("Error");
 	getchar();
 }
//---------------------------------------------------------------
